# Chapter 5 #

In [1]:
import numpy as np
import pandas as pd
import requests
import json

pd.set_option('display.notebook_repr_html', True) #nice tables in iPython
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

In [2]:
pd.DataFrame(np.array([[10, 11], [20, 21]]))

    0   1
0  10  11
1  20  21

In [3]:
df1 = pd.DataFrame([pd.Series(np.arange(10,15)),
                    pd.Series(np.arange(15, 20))])
df1

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [4]:
df1.shape

(2, 5)

In [5]:
df = pd.DataFrame(np.array([[10, 11], [20, 21]]),
                  columns=['a', 'b'])
df

    a   b
0  10  11
1  20  21

In [6]:
df.columns

Index(['a', 'b'], dtype='object')

In [7]:
"{0}, {1}".format(df.columns[0], df.columns[1])

'a, b'

In [8]:
df.columns = ['c1', 'c2']
df

   c1  c2
0  10  11
1  20  21

In [9]:
df = pd.DataFrame(np.array([[0,1], [2,3]]),
                          columns=['c1', 'c2'],
                          index=['r1','r2'])
df

    c1  c2
r1   0   1
r2   2   3

In [10]:
df.index

Index(['r1', 'r2'], dtype='object')

In [11]:
s1 = pd.Series(np.arange(1,6,1))
s2 = pd.Series(np.arange(6,11,1))
pd.DataFrame({'c1': s1, 'c2':s2})

   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10

In [12]:
s3 = pd.Series(np.arange(12, 14), index=[1, 2])
df = pd.DataFrame({'c1': s1, 'c2':s2, 'c3': s3})
df

   c1  c2  c3
0   1   6 NaN
1   2   7  12
2   3   8  13
3   4   9 NaN
4   5  10 NaN

## Example Data

In [13]:
!head -n 3 sp500.csv

Date,Open,High,Low,Close,Volume,Adj Close
2016-02-23,1942.380005,1942.380005,1919.439941,1921.27002,3890650000,1921.27002
2016-02-22,1924.439941,1946.699951,1924.439941,1945.50,4054710000,1945.50

In [14]:
# from: https://finance.yahoo.com/q/hp?s=%5EGSPC+Historical+Prices

sp500 = pd.read_csv('sp500.csv', 
#                     index_col = 'Symbol',
#                     usecols=[0,2,3,7]
                   )

In [15]:
sp500.head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-02-23,1942.380005,1942.380005,1919.439941,1921.270020,3890650000,1921.270020
1,2016-02-22,1924.439941,1946.699951,1924.439941,1945.500000,4054710000,1945.500000
2,2016-02-19,1916.739990,1918.780029,1902.170044,1917.780029,4142850000,1917.780029
3,2016-02-18,1927.569946,1930.000000,1915.089966,1917.829956,4436490000,1917.829956
4,2016-02-17,1898.800049,1930.680054,1898.800049,1926.819946,5011540000,1926.819946

http://data.okfn.org/data/core/s-and-p-500-companies#data
http://data.okfn.org/data/core/s-and-p-500-companies/r/constituents-financials.csv

In [16]:
sp500 = pd.read_csv('sp500_constituents-financials.csv', 
                    index_col = 'Symbol',
                    usecols=[0,2,3,7]
                   )

In [17]:
sp500.head()

                        Sector     Price  Book Value
Symbol
MMM                Industrials  137.9200      20.960
ABT                Health Care   42.2199      15.437
ABBV               Health Care   57.6700       3.330
ACN     Information Technology   96.2400       9.470
ACE                 Financials  100.8900      91.270

In [18]:
sp500.tail()

                        Sector   Price  Book Value
Symbol
XYL                Industrials  32.305      11.460
YHOO    Information Technology  30.445      35.679
YUM     Consumer Discretionary  79.600       3.630
ZBH                Health Care  97.460      49.800
ZTS                Health Care  44.250       2.360

In [19]:
len(sp500)

494

In [20]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ADBE', 'ADT', 'AES', 'AET', 'AMG',
       ...
       'WYNN', 'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZBH', 'ZTS'],
      dtype='object', name='Symbol', length=494)

In [21]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

http://finance.yahoo.com/q/hp?s=AAPL
http://real-chart.finance.yahoo.com/table.csv?s=AAPL&d=1&e=24&f=2016&g=d&a=11&b=12&c=1980&ignore=.csv
http://real-chart.finance.yahoo.com/table.csv?s=MSFT&d=1&e=24&f=2016&g=d&a=11&b=12&c=1980&ignore=.csv

In [22]:
aapl = pd.read_csv("aapl.csv" , 
                   index_col = ['Date'], 
                   usecols=['Date', 'Close'])
aapl.columns = ['AAPL']
aapl.head()

                 AAPL
Date
2016-02-23  94.690002
2016-02-22  96.879997
2016-02-19  96.040001
2016-02-18  96.260002
2016-02-17  98.120003

In [23]:
msft = pd.read_csv("msft.csv" , 
                   index_col = ['Date'],
                   usecols=['Date', 'Close'])
msft.columns = ['MSFT']
msft.head()

                 MSFT
Date
2016-02-23  51.180000
2016-02-22  52.650002
2016-02-19  51.820000
2016-02-18  52.189999
2016-02-17  52.419998

In [24]:
sp500[[1,2]].head() # by zero-based location

           Price  Book Value
Symbol
MMM     137.9200      20.960
ABT      42.2199      15.437
ABBV     57.6700       3.330
ACN      96.2400       9.470
ACE     100.8900      91.270

In [25]:
sp500[[1]].head()

           Price
Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900

In [26]:
type(sp500[[1]].head())

pandas.core.frame.DataFrame

In [27]:
df=sp500.copy()
df.columns=[0,1,2]
df.head()

                             0         1       2
Symbol
MMM                Industrials  137.9200  20.960
ABT                Health Care   42.2199  15.437
ABBV               Health Care   57.6700   3.330
ACN     Information Technology   96.2400   9.470
ACE                 Financials  100.8900  91.270

In [28]:
df[1]

Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900
          ...
XYL      32.3050
YHOO     30.4450
YUM      79.6000
ZBH      97.4600
ZTS      44.2500
Name: 1, dtype: float64

In [29]:
sp500['Price']

Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900
          ...
XYL      32.3050
YHOO     30.4450
YUM      79.6000
ZBH      97.4600
ZTS      44.2500
Name: Price, dtype: float64

In [30]:
sp500[['Price','Sector']]

           Price                  Sector
Symbol
MMM     137.9200             Industrials
ABT      42.2199             Health Care
ABBV     57.6700             Health Care
ACN      96.2400  Information Technology
ACE     100.8900              Financials
...          ...                     ...
XYL      32.3050             Industrials
YHOO     30.4450  Information Technology
YUM      79.6000  Consumer Discretionary
ZBH      97.4600             Health Care
ZTS      44.2500             Health Care

[494 rows x 2 columns]

In [31]:
sp500.Price

Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900
          ...
XYL      32.3050
YHOO     30.4450
YUM      79.6000
ZBH      97.4600
ZTS      44.2500
Name: Price, dtype: float64

In [32]:
type(sp500.Price)

pandas.core.series.Series

In [33]:
loc = sp500.columns.get_loc('Price')
loc

1

### Slicing (not as efficient)

In [34]:
sp500[:5]

                        Sector     Price  Book Value
Symbol
MMM                Industrials  137.9200      20.960
ABT                Health Care   42.2199      15.437
ABBV               Health Care   57.6700       3.330
ACN     Information Technology   96.2400       9.470
ACE                 Financials  100.8900      91.270

In [35]:
sp500['ABT':'ACN']

                        Sector    Price  Book Value
Symbol
ABT                Health Care  42.2199      15.437
ABBV               Health Care  57.6700       3.330
ACN     Information Technology  96.2400       9.470

### by .loc[] and .iloc[]

In [36]:
sp500.loc['MMM']

Sector        Industrials
Price              137.92
Book Value          20.96
Name: MMM, dtype: object

In [37]:
type(sp500.loc['MMM'])

pandas.core.series.Series

In [38]:
sp500.loc[['MMM']]

             Sector   Price  Book Value
Symbol
MMM     Industrials  137.92       20.96

In [39]:
type(sp500.loc[['MMM']])

pandas.core.frame.DataFrame

In [40]:
sp500.loc[['MMM', 'MSFT']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  137.92       20.96
MSFT    Information Technology   43.41        9.98

In [41]:
sp500.iloc[[0, 2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  137.92       20.96
ABBV    Health Care   57.67        3.33

In [42]:
i1 = sp500.index.get_loc('MMM')
i2 = sp500.index.get_loc('A')
i3 = sp500.index.get_loc('MSFT')
"{0} {1} {2}".format(i1, i2, i3)

'0 11 301'

In [43]:
sp500.iloc[[i1, i2, i3]]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  137.92       20.96
A                  Health Care   35.08       12.36
MSFT    Information Technology   43.41        9.98

### ix: combines .loc and .iloc
#### .loc and .iloc recommended for clarity and performance

In [44]:
sp500.ix[['MSFT', 'ZTS']]

                        Sector  Price  Book Value
Symbol
MSFT    Information Technology  43.41        9.98
ZTS                Health Care  44.25        2.36

In [45]:
sp500.ix[[10, 200, 450]]

                        Sector     Price  Book Value
Symbol
AFL                 Financials   56.9150      39.520
GE                 Industrials   24.7101      10.846
UA      Consumer Discretionary  101.3900       6.560

### Scalar lookup

In [46]:
sp500.at['MMM', 'Price']

137.91999999999999

In [47]:
sp500.iat[0,1]

137.91999999999999

# Selection by Boolean

In [48]:
sp500.Price < 100

Symbol
MMM     False
ABT      True
ABBV     True
ACN      True
ACE     False
        ...
XYL      True
YHOO     True
YUM      True
ZBH      True
ZTS      True
Name: Price, dtype: bool

In [49]:
sp500[sp500.Price < 100]

                        Sector    Price  Book Value
Symbol
ABT                Health Care  42.2199      15.437
ABBV               Health Care  57.6700       3.330
ACN     Information Technology  96.2400       9.470
ADBE    Information Technology  82.6800      13.720
ADT                Industrials  30.9000      17.950
...                        ...      ...         ...
XYL                Industrials  32.3050      11.460
YHOO    Information Technology  30.4450      35.679
YUM     Consumer Discretionary  79.6000       3.630
ZBH                Health Care  97.4600      49.800
ZTS                Health Care  44.2500       2.360

[398 rows x 3 columns]

In [56]:
r = sp500[(sp500.Price < 10) & 
          (sp500.Price > 0)]['Price']
r

Symbol
AA      9.450
CHK     8.230
FCX     9.925
FTR     4.860
GNW     4.758
HCBK    9.280
RF      8.950
Name: Price, dtype: float64

There is an error the book

## Modifying structure/content

Renaming Columns

In [58]:
df = sp500.rename(columns = 
                    {'Book Value': 'BookValue'})
df[:2]

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437

In [59]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

In [61]:
sp500.rename(columns = 
            {'Book Value': 'BookValue'},
            inplace = True)
sp500.columns

Index(['Sector', 'Price', 'BookValue'], dtype='object')

In [62]:
sp500.BookValue[:5]

Symbol
MMM     20.960
ABT     15.437
ABBV     3.330
ACN      9.470
ACE     91.270
Name: BookValue, dtype: float64

Inserting Columns

In [63]:
copy = sp500.copy()
copy['TwicePrice'] = sp500.Price * 2
copy[:2]

             Sector     Price  BookValue  TwicePrice
Symbol
MMM     Industrials  137.9200     20.960    275.8400
ABT     Health Care   42.2199     15.437     84.4398

In [64]:
copy = sp500.copy()
copy.insert(1, 'TwicePrice', sp500.Price * 2)
copy[:2]

             Sector  TwicePrice     Price  BookValue
Symbol
MMM     Industrials    275.8400  137.9200     20.960
ABT     Health Care     84.4398   42.2199     15.437

In [66]:
rcopy = sp500[0:3][['Price']].copy()
rcopy

           Price
Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700

In [67]:
s = pd.Series(
            {'MMM': 'Is in the DataFrame',
             'MSFT': 'Not in the DataFrame'} )
s

MMM      Is in the DataFrame
MSFT    Not in the DataFrame
dtype: object

In [68]:
rcopy['Comment'] = s
rcopy

           Price              Comment
Symbol
MMM     137.9200  Is in the DataFrame
ABT      42.2199                  NaN
ABBV     57.6700                  NaN

Replacing content in columns

In [69]:
copy = sp500.copy()
copy.Price = sp500.Price * 2
copy[:5]

                        Sector     Price  BookValue
Symbol
MMM                Industrials  275.8400     20.960
ABT                Health Care   84.4398     15.437
ABBV               Health Care  115.3400      3.330
ACN     Information Technology  192.4800      9.470
ACE                 Financials  201.7800     91.270

In [73]:
copy = sp500.copy()
prices = sp500.iloc[[3, 1, 0]].Price.copy()
prices

Symbol
ACN     96.2400
ABT     42.2199
MMM    137.9200
Name: Price, dtype: float64

In [75]:
copy.Price = prices
copy

                        Sector     Price  BookValue
Symbol
MMM                Industrials  137.9200     20.960
ABT                Health Care   42.2199     15.437
ABBV               Health Care       NaN      3.330
ACN     Information Technology   96.2400      9.470
ACE                 Financials       NaN     91.270
...                        ...       ...        ...
XYL                Industrials       NaN     11.460
YHOO    Information Technology       NaN     35.679
YUM     Consumer Discretionary       NaN      3.630
ZBH                Health Care       NaN     49.800
ZTS                Health Care       NaN      2.360

[494 rows x 3 columns]

Deleting columns

In [76]:
copy = sp500[:2].copy()
copy

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437

In [77]:
del copy['BookValue']
copy

             Sector     Price
Symbol
MMM     Industrials  137.9200
ABT     Health Care   42.2199

In [78]:
copy = sp500[:2].copy()
popped = copy.pop('Sector')
copy

           Price  BookValue
Symbol
MMM     137.9200     20.960
ABT      42.2199     15.437

In [79]:
popped

Symbol
MMM    Industrials
ABT    Health Care
Name: Sector, dtype: object

use .drop to remove a column

In [80]:
copy = sp500[:2].copy()
afterdrop = copy.drop(['Sector'], axis = 1)
afterdrop

           Price  BookValue
Symbol
MMM     137.9200     20.960
ABT      42.2199     15.437

use .drop to remove a row

In [81]:
copy = sp500[:2].copy()
afterdrop = copy.drop(['ABT'], axis = 0)
afterdrop

             Sector   Price  BookValue
Symbol
MMM     Industrials  137.92      20.96

Adding rows